{"Item": "garbage / beer / paint", "Answer": "can", "Reason": "A can is used as a container for garbage, beer, and paint. So, the correct answer is can.", "Reason-reversed-meta": "The correct answer is can. Because the can is used as a container for every three words. A garbage can is a container for garbage, a can is used for containing beer, and a paint can contains paint.", "Reasons-reversed": "The correct answer is can. A garbage can is a container for garbage, a can is used for containing beer, and a paint can contains paint.", "Reason-chain": "A garbage can is a container for garbage, a can is used for containing beer, and paint can is for containing paint. Therefore, the can is used as a container for all three words. So, the correct answer is can.", "Reason-chain-wo-meta": "A garbage can is a container for garbage, a can is used for containing beer, and paint can is for containing paint. So, the correct answer is can."}
{"Item": "bass / complex / sleep", "Answer": "deep", "Reason": "Bass makes a deep sound, a complex thing has deep layers, and sleep is a deep state of unconsciousness. So, the correct answer is deep.", "Reason-reversed-meta": "The correct answer is deep. Because the deep is used for indicating a certain level of three words. Bass sounds a deep level of sound, a complex thing is at a deep level, and sleep can be deep.", "Reasons-reversed": "The correct answer is deep. Bass sounds a deep level of sound, a complex thing is at a deep level, and sleep can be deep.", "Reason-chain": "Bass sounds a deep level of sound, a complex thing is at a deep level, and sleep is a deep state of unconsciousness. Therefore, the deep is used for indicating a certain level of three words. So, the correct answer is deep.", "Reason-chain-wo-meta": "Bass sounds a deep level of sound, a complex thing is at a deep level, and sleep is a deep state of unconsciousness. So, the correct answer is deep."}
{"Item": "scan / nap / burglar", "Answer": "cat", "Reason": "A cat is a way of brain scan, a cat takes a nap, and a cat is adept at entering and leaving without noticing like a burglar. So, the correct answer is cat.", "Reason-reversed-meta": "The correct answer is cat. Because the cat is associated with every three words. A cat is a way of brain scanning, a cat takes a nap, and a cat is adept at entering and leaving without noticing like a burglar.", "Reasons-reversed": "The correct answer is cat. A cat is a way of brain scanning, a cat takes a nap, and a cat is adept at entering and leaving without noticing like a burglar.", "Reason-chain": "A cat is a way of brain scanning, a cat takes a nap, and a cat is adept at entering and leaving without noticing like a burglar. Therefore, the cat is associated with every three words. So, the correct answer is cat.", "Reason-chain-wo-meta": "A cat is a way of brain scanning, a cat takes a nap, and a cat is adept at entering and leaving without noticing like a burglar. So, the correct answer is cat."}
{"Item": "roll / bean / fish", "Answer": "jelly", "Reason": "A jelly roll and a jelly bean are food using jelly as an ingredient. A jellyfish is composed of a jelly-like substance. So, the correct answer is jelly.", "Reason-reversed-meta": "The correct answer is jelly. Because the jelly can be used to make compounds with every three words. A jelly roll is a cake full of jam, a jelly bean is a jelly-shaped sugar candy, and the outer surface of jellyfish is made of a jelly-like substance.", "Reasons-reversed": "The correct answer is jelly. A jelly roll is a cake full of jam, a jelly bean is a jelly-shaped sugar candy, and the outer surface of jellyfish is made of a jelly-like substance.", "Reason-chain": "A jelly roll is a cake full of jam, a jelly bean is a jelly-shaped sugar candy, and the outer surface of jellyfish is made of a jelly-like substance. Therefore, the jelly can be used to make compounds with every three words. So, the correct answer is jelly.", "Reason-chain-wo-meta": "A jelly roll is a cake full of jam, a jelly bean is a jelly-shaped sugar candy, and the outer surface of jellyfish is made of a jelly-like substance. So, the correct answer is jelly."}
{"Item": "set / program / cable", "Answer": "television", "Reason": "A set of programs can be accessed through cable television. So, the correct answer is television.", "Reason-reversed-meta": "The correct answer is television. Because the television is often used with every three words. A television set is a piece of equipment with a screen that receives images and sounds sent by television, a television program is something that we can watch on television, and cable television is a system in which television programs are transmitted.", "Reasons-reversed": "The correct answer is television. A television set is a piece of equipment with a screen that receives images and sounds sent by television, a television program is something that we can watch on television, and cable television is a system in which television programs are transmitted.", "Reason-chain": "A television set is a piece of equipment with a screen that receives images and sounds sent by television, a television program is something that we can watch on television, and cable television is a system in which television programs are transmitted. Therefore, television is often used with every three words. So, the correct answer is television.", "Reason-chain-wo-meta": "A television set is a piece of equipment with a screen that receives images and sounds sent by television, a television program is something that we can watch on television, and cable television is a system in which television programs are transmitted. So, the correct answer is television."}
{"Item": "grand / door / bang", "Answer": "slam", "Reason": "Grand slam refers to the huge accomplishment of winning, and door slams with a bang sound. So, the correct answer is slam.", "Reason-reversed-meta": "The correct answer is slam. Because the slam can be used to make compounds with every three words. A grand slam refers to the huge accomplishment of winning, a door slam means cutting people out of your life, and a slam-bang refers to something exciting.", "Reasons-reversed": "The correct answer is slam. A grand slam refers to the huge accomplishment of winning, a door slam means cutting people out of your life, and a slam-bang refers to something exciting.", "Reason-chain": "A grand slam refers to the huge accomplishment of winning, a door slam means cutting people out of your life, and a slam-bang refers to something exciting. Therefore, the slam can be used to make compounds with every three words. So, the correct answer is slam.", "Reason-chain-wo-meta": "A grand slam refers to the huge accomplishment of winning, a door slam means cutting people out of your life, and a slam-bang refers to something exciting. So, the correct answer is slam."}
{"Item": "shock / shave / taste", "Answer": "after", "Reason": "An aftershock is a smaller earthquake after a larger mainshock, aftershave is a product applied to the skin after shaving, and an aftertaste is a taste remaining after eating. So, the correct answer is after.", "Reason-reversed-meta": "The correct answer is after. Because the after can be used to make compounds with every three words. An aftershock is a small earthquake after a large mainshock, an aftershave is a product applied to the skin after shaving, and an aftertaste is a taste remaining after eating.", "Reasons-reversed": "The correct answer is after. An aftershock is a small earthquake after a large mainshock, an aftershave is a product applied to the skin after shaving, and an aftertaste is a taste remaining after eating.", "Reason-chain": "An aftershock is a small earthquake after a large mainshock, an aftershave is a product applied to the skin after shaving, and an aftertaste is a taste remaining after eating. Therefore, the after can be used to make compounds with every three words. So, the correct answer is after.", "Reason-chain-wo-meta": "An aftershock is a small earthquake after a large mainshock, an aftershave is a product applied to the skin after shaving, and an aftertaste is a taste remaining after eating. So, the correct answer is after."}
{"Item": "wise / work / tower", "Answer": "clock", "Reason": "A clockwise and clockwork share a consistent feature like a clock. A clock tower is a specific structure with a clock. So, the correct answer is clock.", "Reason-reversed-meta": "The correct answer is clock. Because the clock is associated with every three words. A clockwise is a motion that proceeds in the same direction as a clock, clockwork refers to a gear inside of the clock, and a clock tower is a structure with a clock.", "Reasons-reversed": "The correct answer is clock. A clockwise is a motion that proceeds in the same direction as a clock, clockwork refers to a gear inside of the clock, and a clock tower is a structure with a clock.", "Reason-chain": "A clockwise is a motion that proceeds in the same direction as a clock, clockwork refers to a gear inside of the clock, and a clock tower is a structure with a clock. Therefore, the clock is associated with every three words. So, the correct answer is clock.", "Reason-chain-wo-meta": "A clockwise is a motion that proceeds in the same direction as a clock, clockwork refers to a gear inside of the clock, and a clock tower is a structure with a clock. So, the correct answer is clock."}
{"Item": "dive / light / rocket", "Answer": "sky", "Reason": "A skydive is diving in the sky, a skylight is a window that permits light in the sky, and a rocket jumps to the sky. So, the correct answer is sky.", "Reason-reversed-meta": "The correct answer is sky. Because the sky can be used to make compounds with every three words. A skydive is diving in the sky, a skylight is a window that permits light in the sky, and a skyrocket refers to something increasing rapidly into the sky.", "Reasons-reversed": "The correct answer is sky. A skydive is diving in the sky, a skylight is a window that permits light in the sky, and a skyrocket refers to something increasing rapidly into the sky.", "Reason-chain": "A skydive is diving in the sky, a skylight is a window that permits light in the sky, and a skyrocket refers to something increasing rapidly into the sky. Therefore, the sky can be used to make compounds with every three words. So, the correct answer is sky.", "Reason-chain-wo-meta": "A skydive is diving in the sky, a skylight is a window that permits light in the sky, and a skyrocket refers to something increasing rapidly into the sky. So, the correct answer is sky."}
{"Item": "lounge / hour / napkin", "Answer": "cocktail", "Reason": "You can drink a cocktail in the lounge, and cocktail hour and a cocktail napkin can be found in the lounge. So, the correct answer is cocktail.", "Reason-reversed-meta": "The correct answer is cocktail. Because the cocktail is associated with every three words. A cocktail lounge is a place where you go for a cocktail, happy hour is a time for offering reduced prices on a cocktail, and a cocktail napkin is served with beverages like cocktails.", "Reasons-reversed": "The correct answer is cocktail. A cocktail lounge is a place where you go for a cocktail, happy hour is a time for offering reduced prices on a cocktail, and a cocktail napkin is served with beverages like cocktails.", "Reason-chain": "A cocktail lounge is a place where you go for a cocktail, happy hour is a time for offering reduced prices on a cocktail, and a cocktail napkin is served with beverages like cocktails. Therefore, the cocktail is associated with every three words. So, the correct answer is cocktail.", "Reason-chain-wo-meta": "A cocktail lounge is a place where you go for a cocktail, happy hour is a time for offering reduced prices on a cocktail, and a cocktail napkin is served with beverages like cocktails. So, the correct answer is cocktail."}
{"Item": "opera / hand / dish", "Answer": "soap", "Reason": "A soap opera originated from radio dramas sponsored by soap manufacturers. A hand and dish can be washed with soap. So, the correct answer is soap.", "Reason-reversed-meta": "The correct answer is soap. Because the soap is associated with every three words. A soap opera originated from radio dramas sponsored by soap manufacturers, hand soap is for washing hands, and dish soap is for washing dishes.", "Reasons-reversed": "The correct answer is soap. A soap opera originated from radio dramas sponsored by soap manufacturers, hand soap is for washing hands, and dish soap is for washing dishes.", "Reason-chain": "A soap opera originated from radio dramas sponsored by soap manufacturers, hand soap is for washing hands, and dish soap is for washing dishes. Therefore, the soap is associated with every three words. So, the correct answer is soap.", "Reason-chain-wo-meta": "A soap opera originated from radio dramas sponsored by soap manufacturers, hand soap is for washing hands, and dish soap is for washing dishes. So, the correct answer is soap."}
{"Item": "skirts / take / put", "Answer": "out", "Reason": "A outskirts is outside of the city, takeout is taking something out from the store, and output is an outcome of a system. So, the correct answer is out.", "Reason-reversed-meta": "The correct answer is out. Because the out can be used to make compounds with every three words. A outskirts is outside of the city, takeout is taking something out from the store, and output is an outcome of a system.", "Reasons-reversed": "The correct answer is out. A outskirts is outside of the city, takeout is taking something out from the store, and output is an outcome of a system.", "Reason-chain": "A outskirts is outside of the city, takeout is taking something out from the store, and output is an outcome of a system. Therefore, the out can be used to make compounds with every three words. So, the correct answer is out.", "Reason-chain-wo-meta": "A outskirts is outside of the city, takeout is taking something out from the store, and output is an outcome of a system. So, the correct answer is out."}
{"Item": "demon / limit / way", "Answer": "speed", "Reason": "A speed demon is a song name, the speed limit should be regulated in a way. So, the correct answer is speed.", "Reason-reversed-meta": "The correct answer is speed. Because the speed is associated with every three words. A speed demon is a comic book character who moves at high speed, a speed limit is a road traffic limit for a car speed, and speedway is a sport with a motorcycle competing with speed.", "Reasons-reversed": "The correct answer is speed. A speed demon is a comic book character who moves at high speed, a speed limit is a road traffic limit for a car speed, and speedway is a sport with a motorcycle competing with speed.", "Reason-chain": "A speed demon is a comic book character who moves at high speed, a speed limit is a road traffic limit for a car speed, and speedway is a sport with a motorcycle competing with speed. Therefore, the speed is associated with every three words. So, the correct answer is speed.", "Reason-chain-wo-meta": "A speed demon is a comic book character who moves at high speed, a speed limit is a road traffic limit for a car speed, and speedway is a sport with a motorcycle competing with speed. So, the correct answer is speed."}
{"Item": "through / disk / way", "Answer": "drive", "Reason": "A drive through is a take-out service that allows customers to purchase products in a way. A driveway is the garage entrance. And a disk drive is a device that storages data on a disk. So, the correct answer is drive.", "Reason-reversed-meta": "The correct answer is drive. Because the drive can be used to make compounds with every three words. A drive through is a take-out service that allows customers to purchase products in a driveway, a disk drive is a device that storages data on a disk, and a driveway is the garage entrance.", "Reasons-reversed": "The correct answer is drive. A drive through is a take-out service that allows customers to purchase products in a driveway, a disk drive is a device that storages data on a disk, and a driveway is the garage entrance.", "Reason-chain": "A drive through is a take-out service that allows customers to purchase products in a driveway, a disk drive is a device that storages data on a disk, and a driveway is the garage entrance. Therefore, the drive can be used to make compounds with every three words. So, the correct answer is drive.", "Reason-chain-wo-meta": "A drive through is a take-out service that allows customers to purchase products in a driveway, a disk drive is a device that storages data on a disk, and a driveway is the garage entrance. So, the correct answer is drive."}
{"Item": "officer / cash / larceny", "Answer": "petty", "Reason": "A petty officer, petty cash, and petty larceny have petty importance. So, the correct answer is petty.", "Reason-reversed-meta": "The correct answer is petty. Because petty is used for indicating the low importance of every three words. A petty officer is a junior-level sergeant, petty cash is a small amount of money available for paying small expenses, and petty larceny is a theft where the value of the property taken is low.", "Reasons-reversed": "The correct answer is petty. A petty officer is a junior-level sergeant, petty cash is a small amount of money available for paying small expenses, and petty larceny is a theft where the value of the property taken is low.", "Reason-chain": "A petty officer is a junior-level sergeant, petty cash is a small amount of money available for paying small expenses, and petty larceny is a theft where the value of the property taken is low. Therefore, petty is used for indicating the low importance of every three words. So, the correct answer is petty.", "Reason-chain-wo-meta": "A petty officer is a junior-level sergeant, petty cash is a small amount of money available for paying small expenses, and petty larceny is a theft where the value of the property taken is low. So, the correct answer is petty."}
{"Item": "pike / coat / signal", "Answer": "turn", "Reason": "A turnpike is a road that you have to turn back without access, turncoat refers to a traitor who turned their coats from one to another, and you have to turn at the turn signal. So, the correct answer is turn.", "Reason-reversed-meta": "The correct answer is turn. Because turn is associated with every three words. A turnpike is a road that you have to pay for access, turncoat refers to a traitor who turned their coats from one to another, and you have to turn at the turn signal.", "Reasons-reversed": "The correct answer is turn. A turnpike is a road that you have to pay for access, turncoat refers to a traitor who turned their coats from one to another, and you have to turn at the turn signal.", "Reason-chain": "A turnpike is a road that you have to pay for access, turncoat refers to a traitor who turned their coats from one to another, and you have to turn at the turn signal. Therefore, the turn is associated with every three words. So, the correct answer is turn.", "Reason-chain-wo-meta": "A turnpike is a road that you have to pay for access, turncoat refers to a traitor who turned their coats from one to another, and you have to turn at the turn signal. So, the correct answer is turn."}
{"Item": "zone / still / noise", "Answer": "quiet", "Reason": "A quiet zone is a place where you have to be quiet, noun still has the same meaning as quiet, and noise has the opposite meaning of quiet. So, the correct answer is quiet.", "Reason-reversed-meta": "The correct answer is quiet. Because quiet is associated with every three words. A quiet zone is a place where you have to be quiet, noun still has the same meaning as quiet, and noise has the opposite meaning of quiet.", "Reasons-reversed": "The correct answer is quiet. A quiet zone is a place where you have to be quiet, noun still has the same meaning as quiet, and noise has the opposite meaning of quiet.", "Reason-chain": "A quiet zone is a place where you have to be quiet, noun still has the same meaning as quiet, and noise has the opposite meaning of quiet. Therefore, quiet is associated with every three words. So, the correct answer is quiet.", "Reason-chain-wo-meta": "A quiet zone is a place where you have to be quiet, noun still has the same meaning as quiet, and noise has the opposite meaning of quiet. So, the correct answer is quiet."}
{"Item": "room / blood / salts", "Answer": "bath", "Reason": "A bathroom is a place for a salts bath, and a bloodbath is a slaughter of a great number of people as a bath is full of their blood. So, the correct answer is bath.", "Reason-reversed-meta": "The correct answer is bath. Because the bath can be used to make compounds with every three words. A bathroom is a room with a bathtub, a bloodbath is a slaughter of a great number of people as a bath is full of their blood, and bath salts are water-soluble minerals that are added to water to be used for a bath.", "Reasons-reversed": "The correct answer is bath. A bathroom is a room with a bathtub, a bloodbath is a slaughter of a great number of people as a bath is full of their blood, and bath salts are water-soluble minerals that are added to water to be used for a bath.", "Reason-chain": "A bathroom is a room with a bathtub, a bloodbath is a slaughter of a great number of people as a bath is full of their blood, and bath salts are water-soluble minerals that are added to water to be used for a bath. Therefore, the bath can be used to make compounds with every three words. So, the correct answer is bath.", "Reason-chain-wo-meta": "A bathroom is a room with a bathtub, a bloodbath is a slaughter of a great number of people as a bath is full of their blood, and bath salts are water-soluble minerals that are added to water to be used for a bath. So, the correct answer is bath."}
{"Item": "cover / arm / wear", "Answer": "under", "Reason": "An undercover is working under the surface secretly, underwear is worn under clothing, and an underarm is a part under shoulder level. So, the correct answer is under.", "Reason-reversed-meta": "The correct answer is under. Because the under can be used to make compounds with every three words. An undercover is working under the surface secretly, underarm refers to the state equipped for war, and underwear is the clothing worn under clothes.", "Reasons-reversed": "The correct answer is under. An undercover is working under the surface secretly, underarm refers to the state equipped for war, and underwear is the clothing worn under clothes.", "Reason-chain": "An undercover is working under the surface secretly, underarm refers to the state equipped for war, and underwear is the clothing worn under clothes. Therefore, the under can be used to make compounds with every three words. So, the correct answer is under.", "Reason-chain-wo-meta": "An undercover is working under the surface secretly, underarm refers to the state equipped for war, and underwear is the clothing worn under clothes. So, the correct answer is under."}
{"Item": "master / toss / finger", "Answer": "ring", "Reason": "A ringmaster is a master of a ring in a circus, a ring toss game is a play throwing rings, and you put a ring on a finger. So, the correct answer is ring.", "Reason-reversed-meta": "The correct answer is ring. Because the ring is associated with every three words. A ringmaster is a master of a ring in a circus, a ring toss game is a play throwing rings, and you put a ring on a finger.", "Reasons-reversed": "The correct answer is ring. A ringmaster is a master of a ring in a circus, a ring toss game is a play throwing rings, and you put a ring on a finger.", "Reason-chain": "A ringmaster is a master of a ring in a circus, a ring toss game is a play throwing rings, and you put a ring on a finger. Therefore, the ring is associated with every three words. So, the correct answer is ring.", "Reason-chain-wo-meta": "A ringmaster is a master of a ring in a circus, a ring toss game is a play throwing rings, and you put a ring on a finger. So, the correct answer is ring."}
{"Item": "mouse / bear / sand", "Answer": "trap", "Reason": "A mouse and bear can be captured with a trap. A sand trap catches sand in the hole. So, the correct answer is trap.", "Reason-reversed-meta": "The correct answer is trap. Because the trap is used to capture something in every three words. A mouse can be captured with a trap, a bear can be captured with a trap, and a sand trap can capture a golf ball.", "Reasons-reversed": "The correct answer is trap. A mouse can be captured with a trap, a bear can be captured with a trap, and a sand trap can capture a golf ball.", "Reason-chain": "A mouse can be captured with a trap, a bear can be captured with a trap, and a sand trap can capture a golf ball. Therefore, the trap is used to capture something in every three words. So, the correct answer is trap.", "Reason-chain-wo-meta": "A mouse can be captured with a trap, a bear can be captured with a trap, and a sand trap can capture a golf ball. So, the correct answer is trap."}
{"Item": "pie / luck / belly", "Answer": "pot", "Reason": "A potluck means luck of the pot. A pot pie and pot belly are pot shaped. So, the correct answer is pot.", "Reason-reversed-meta": "The correct answer is pot. Because the pot can be used to make compounds with every three words. A potpie is a meat pie with pot shaped, a potluck is a gathering with food in a pot, and a pot belly is a pot shaped belly.", "Reasons-reversed": "The correct answer is pot. A potpie is a meat pie with pot shaped, a potluck is a gathering with food in a pot, and a pot belly is a pot shaped belly.", "Reason-chain": "A potpie is a meat pie with pot shaped, a potluck is a gathering with food in a pot, and a pot belly is a pot shaped belly. Therefore, the pot can be used to make compounds with every three words. So, the correct answer is pot.", "Reason-chain-wo-meta": "A potpie is a meat pie with pot shaped, a potluck is a gathering with food in a pot, and a pot belly is a pot shaped belly. So, the correct answer is pot."}
{"Item": "board / blade / back", "Answer": "switch", "Reason": "A switchboard and blade switch are related to electricity. A switchback refers to the state returning to some previous condition. So, the correct answer is switch.", "Reason-reversed-meta": "The correct answer is switch. Because the switch can be used to make compounds with every three words. A switchboard is a device that distributes electricity to smaller devices, blade switch is a type of switch used to control the flow of electricity in a circuit, and switchback refers to the moment returning back to some previous times.", "Reasons-reversed": "The correct answer is switch. A switchboard is a device that distributes electricity to smaller devices, blade switch is a type of switch used to control the flow of electricity in a circuit, and switchback refers to the moment returning back to some previous times.", "Reason-chain": "A switchboard is a device that distributes electricity to smaller devices, blade switch is a type of switch used to control the flow of electricity in a circuit, and switchback refers to the moment returning back to some previous times. Therefore, the switch can be used to make compounds with every three words. So, the correct answer is switch.", "Reason-chain-wo-meta": "A switchboard is a device that distributes electricity to smaller devices, blade switch is a type of switch used to control the flow of electricity in a circuit, and switchback refers to the moment returning back to some previous times. So, the correct answer is switch."}
{"Item": "loser / throat / spot", "Answer": "sore", "Reason": "A sore loser, sore throat, and sore spot are associated with sore sickness. So, the correct answer is sore.", "Reason-reversed-meta": "The correct answer is sore. Because the sore can be used to indicate pain with every three words. A sore loser refers to one who complains about pain, a sore throat refers to a painful feeling in the throat, and a sore spot is a painful part of the body.", "Reasons-reversed": "The correct answer is sore. A sore loser refers to one who complains about pain, a sore throat refers to a painful feeling in the throat, and a sore spot is a painful part of the body.", "Reason-chain": "A sore loser refers to one who complains about pain, a sore throat refers to a painful feeling in the throat, and a sore spot is a painful part of the body. Therefore, the sore can be used to indicate pain with every three words. So, the correct answer is sore.", "Reason-chain-wo-meta": "A sore loser refers to one who complains about pain, a sore throat refers to a painful feeling in the throat, and a sore spot is a painful part of the body. So, the correct answer is sore."}
{"Item": "artist / hatch / route", "Answer": "escape", "Reason": "An artist has to escape from stereotypes, and hatch and route can be used to escape. So, the correct answer is escape.", "Reason-reversed-meta": "The correct answer is escape. Because the escape can be used to express getting out of something with every three words. An escape artist is escaping from constraints, a hatch provides an exit for escaping, and an escape route is for escaping from a dangerous situation.", "Reasons-reversed": "The correct answer is escape. An escape artist is escaping from constraints, a hatch provides an exit for escaping, and an escape route is for escaping from a dangerous situation.", "Reason-chain": "An escape artist is escaping from constraints, a hatch provides an exit for escaping, and an escape route is for escaping from a dangerous situation. Therefore, the escape can be used to express getting out of something with every three words. So, the correct answer is escape.", "Reason-chain-wo-meta": "An escape artist is escaping from constraints, a hatch provides an exit for escaping, and an escape route is for escaping from a dangerous situation. So, the correct answer is escape."}
{"Item": "fight / control / machine", "Answer": "gun", "Reason": "A machine gun is used for a fight and gun control is a policy to regulate guns. So, the correct answer is gun.", "Reason-reversed-meta": "The correct answer is gun. Because the gun is associated with every three words. A machine gun is a fully automated gun, a gun can be used for a fight, and gun control restricts the possession of a gun.", "Reasons-reversed": "The correct answer is gun. A machine gun is a fully automated gun, a gun can be used for a fight, and gun control restricts the possession of a gun.", "Reason-chain": "A machine gun is a fully automated gun, a gun can be used for a fight, and gun control restricts the possession of a gun. Therefore, the gun is associated with every three words. So, the correct answer is gun.", "Reason-chain-wo-meta": "A machine gun is a fully automated gun, a gun can be used for a fight, and gun control restricts the possession of a gun. So, the correct answer is gun."}
{"Item": "poison / league / creeping", "Answer": "ivy", "Reason": "Ivy is found creeping up buildings, ivy has poison, and ivy league universities are well known for the tradition of planting ivy. So, the correct answer is ivy.", "Reason-reversed-meta": "The correct answer is ivy. Because ivy is associated with every three words. An ivy has poison, ivy league universities are well known for the tradition of planting the ivy, and ivy is found creeping up buildings.", "Reasons-reversed": "The correct answer is ivy. An ivy has poison, ivy league universities are well known for the tradition of planting the ivy, and ivy is found creeping up buildings.", "Reason-chain": "An ivy has poison, ivy league universities are well known for the tradition of planting the ivy, and ivy is found creeping up buildings. Therefore, ivy is associated with every three words. So, the correct answer is ivy.", "Reason-chain-wo-meta": "An ivy has poison, ivy league universities are well known for the tradition of planting the ivy, and ivy is found creeping up buildings. So, the correct answer is ivy."}
{"Item": "sharp / thumb / tie", "Answer": "tack", "Reason": "A tack thumb and tack tie are sharp. So, the correct answer is tack.", "Reason-reversed-meta": "The correct answer is tack. Because tack can be used to make compounds with every three words. A tack sharp means very sharp, a thumb tack is a short-headed pin, and a tack tie is a small pin that is placed behind the tie to prevent the tie from moving around.", "Reasons-reversed": "The correct answer is tack. A tack sharp means very sharp, a thumb tack is a short-headed pin, and a tack tie is a small pin that is placed behind the tie to prevent the tie from moving around.", "Reason-chain": "A tack sharp means very sharp, a thumb tack is a short-headed pin, and a tack tie is a small pin that is placed behind the tie to prevent the tie from moving around. Therefore, tack can be used to make compounds with every three words. So, the correct answer is tack.", "Reason-chain-wo-meta": "A tack sharp means very sharp, a thumb tack is a short-headed pin, and a tack tie is a small pin that is placed behind the tie to prevent the tie from moving around. So, the correct answer is tack."}
{"Item": "fox / man / peep", "Answer": "hole", "Reason": "A foxhole and manhole are a hole in the ground, and you can peep through a hole. So, the correct answer is hole.", "Reason-reversed-meta": "The correct answer is hole. Because hole is associated with every three words. A foxhole is a hole in the ground used by troops as a shelter, a manhole is a hole in the ground, and you can peep through the hole.", "Reasons-reversed": "The correct answer is hole. A foxhole is a hole in the ground used by troops as a shelter, a manhole is a hole in the ground, and you can peep through the hole.", "Reason-chain": "A foxhole is a hole in the ground used by troops as a shelter, a manhole is a hole in the ground, and you can peep through the hole. Therefore, hole is associated with every three words. So, the correct answer is hole.", "Reason-chain-wo-meta": "A foxhole is a hole in the ground used by troops as a shelter, a manhole is a hole in the ground, and you can peep through the hole. So, the correct answer is hole."}
{"Item": "color / numbers / oil", "Answer": "paint", "Reason": "A combination of color and oil can be used for kids to paint coloring numbers. So, the correct answer is paint.", "Reason-reversed-meta": "The correct answer is paint. Because paint is associated with every three words. Paint has lots of colors, paint by number is a kit with markings of corresponding numbered paint to use, and paint is made of oil.", "Reasons-reversed": "The correct answer is paint. Paint has lots of colors, paint by number is a kit with markings of corresponding numbered paint to use, and paint is made of oil.", "Reason-chain": "Paint has lots of colors, paint by number is a kit with markings of corresponding numbered paint to use, and paint is made of oil. Therefore, paint is associated with every three words. So, the correct answer is paint.", "Reason-chain-wo-meta": "Paint has lots of colors, paint by number is a kit with markings of corresponding numbered paint to use, and paint is made of oil. So, the correct answer is paint."}
{"Item": "leg / arm / person", "Answer": "chair", "Reason": "A chair and armchair have legs, and a chairperson occupies a chair of authority. So, the correct answer is chair.", "Reason-reversed-meta": "The correct answer is chair. Because the chair is associated with every three words. A chair has legs, an armchair is a chair with side supports for arms, and a chairperson occupies a chair of authority.", "Reasons-reversed": "The correct answer is chair. A chair has legs, an armchair is a chair with side supports for arms, and a chairperson occupies a chair of authority.", "Reason-chain": "A chair has legs, an armchair is a chair with side supports for arms, and a chairperson occupies a chair of authority. Therefore, the chair is associated with every three words. So, the correct answer is chair.", "Reason-chain-wo-meta": "A chair has legs, an armchair is a chair with side supports for arms, and a chairperson occupies a chair of authority. So, the correct answer is chair."}
{"Item": "ticket / shop / broker", "Answer": "pawn", "Reason": "A ticket, shop, and broker are related to exchanging something with money which is a definition of a pawn. So, the correct answer is pawn.", "Reason-reversed-meta": "The correct answer is pawn. Because the pawn can be used to indicate exchanging something for money with every three words. A pawn ticket is a receipt of acknowledgment that payment has been made, a pawn shop is a shop where you can exchange something for money, and a broker arranges exchanges between a buyer and a seller.", "Reasons-reversed": "The correct answer is pawn. A pawn ticket is a receipt of acknowledgment that payment has been made, a pawn shop is a shop where you can exchange something for money, and a broker arranges exchanges between a buyer and a seller.", "Reason-chain": "A pawn ticket is a receipt of acknowledgment that payment has been made, a pawn shop is a shop where you can exchange something for money, and a broker arranges exchanges between a buyer and a seller. Therefore, the pawn can be used to indicate exchanging something for money with every three words. So, the correct answer is pawn.", "Reason-chain-wo-meta": "A pawn ticket is a receipt of acknowledgment that payment has been made, a pawn shop is a shop where you can exchange something for money, and a broker arranges exchanges between a buyer and a seller. So, the correct answer is pawn."}
{"Item": "soap / shoe / tissue", "Answer": "box", "Reason": "A box can be used for containing soap, shoe, and tissue. So, the correct answer is box.", "Reason-reversed-meta": "The correct answer is box. Because the box is associated with every three words. A soapbox refers to a situation where someone expresses strong opinions, a shoe box contains shoes, and a tissue box contains tissue.", "Reasons-reversed": "The correct answer is box. A soapbox refers to a situation where someone expresses strong opinions, a shoe box contains shoes, and a tissue box contains tissue.", "Reason-chain": "A soapbox refers to a situation where someone expresses strong opinions, a shoe box contains shoes, and a tissue box contains tissue. Therefore, the box is associated with every three words. So, the correct answer is box.", "Reason-chain-wo-meta": "A soapbox refers to a situation where someone expresses strong opinions, a shoe box contains shoes, and a tissue box contains tissue. So, the correct answer is box."}
{"Item": "up / book / charge", "Answer": "cover", "Reason": "A coverup is used for covering tattoos, a book cover is used for covering book pages, and a cover charge is used for an entrance fee. So, the correct answer is cover.", "Reason-reversed-meta": "The correct answer is cover. Because the cover can be used to make compounds with every three words. A coverup means covering tattoos, a book cover is for covering book pages, and a cover charge refers to an entrance fee.", "Reasons-reversed": "The correct answer is cover. A coverup means covering tattoos, a book cover is for covering book pages, and a cover charge refers to an entrance fee.", "Reason-chain": "A coverup means covering tattoos, a book cover is for covering book pages, and a cover charge refers to an entrance fee. Therefore, the cover can be used to make compounds with every three words. So, the correct answer is cover.", "Reason-chain-wo-meta": "A coverup means covering tattoos, a book cover is for covering book pages, and a cover charge refers to an entrance fee. So, the correct answer is cover."}
{"Item": "cherry / time / smell", "Answer": "blossom", "Reason": "When the time a cherry blossom blossoms, you can smell the blossoms. So, the correct answer is blossom.", "Reason-reversed-meta": "The correct answer is blossom. Because the blossom is associated with every three words. A cherry blossom is a type of blossom, blossom time indicates the time of a blossom, and you can smell the blossom.", "Reasons-reversed": "The correct answer is blossom. A cherry blossom is a type of blossom, blossom time indicates the time of a blossom, and you can smell the blossom.", "Reason-chain": "A cherry blossom is a type of blossom, blossom time indicates the time of a blossom, and you can smell the blossom. Therefore, the blossom is associated with every three words. So, the correct answer is blossom.", "Reason-chain-wo-meta": "A cherry blossom is a type of blossom, blossom time indicates the time of a blossom, and you can smell the blossom. So, the correct answer is blossom."}
{"Item": "due / life / tense", "Answer": "past", "Reason": "A past due and past life refers to that something has gone past time, and past is a grammatical function of tense. So, the correct answer is past.", "Reason-reversed-meta": "The correct answer is past. Because the past is used in the context of time with every three words. Due date is a time used with the past tense, past life is when you talk about a past time when you were younger, and past is a grammatical function of tense.", "Reasons-reversed": "The correct answer is past. Due date is a time used with the past tense, past life is when you talk about a past time when you were younger, and past is a grammatical function of tense.", "Reason-chain": "Due date is a time used with the past tense, past life is when you talk about a past time when you were younger, and past is a grammatical function of tense. Therefore, the past is used in the context of time with every three words. So, the correct answer is past.", "Reason-chain-wo-meta": "Due date is a time used with the past tense, past life is when you talk about a past time when you were younger, and past is a grammatical function of tense. So, the correct answer is past."}
{"Item": "blank / list / mate", "Answer": "check", "Reason": "You should fill out a blank check and checklist, and checkmate refers to when the king of the player is in check. So, the correct answer is check.", "Reason-reversed-meta": "The correct answer is check. Because the check can be used to make compounds with every three words. A blank check is a signed check with the amount left for the payee to fill in, a checklist is a list of items required, and a checkmate refers to when the king of the player is in check.", "Reasons-reversed": "The correct answer is check. A blank check is a signed check with the amount left for the payee to fill in, a checklist is a list of items required, and a checkmate refers to when the king of the player is in check.", "Reason-chain": "A blank check is a signed check with the amount left for the payee to fill in, a checklist is a list of items required, and a checkmate refers to when the king of the player is in check. Therefore, the check can be used to make compounds with every three words. So, the correct answer is check.", "Reason-chain-wo-meta": "A blank check is a signed check with the amount left for the payee to fill in, a checklist is a list of items required, and a checkmate refers to when the king of the player is in check. So, the correct answer is check."}
{"Item": "pile / market / room", "Answer": "stock", "Reason": "A pile stock is a pile of things for future use, a stock market is a place where you can sell and buy stocks, and a room is a place where you can stock something. So, the correct answer is stock.", "Reason-reversed-meta": "The correct answer is stock. Because the stock is associated with every three words. A pile stock is a pile of things for future use, a stock market is a place where you can sell and buy stocks, and a room is a good place for stock goods.", "Reasons-reversed": "The correct answer is stock. A pile stock is a pile of things for future use, a stock market is a place where you can sell and buy stocks, and a room is a good place for stock goods.", "Reason-chain": "A pile stock is a pile of things for future use, a stock market is a place where you can sell and buy stocks, and a room is a good place for stock goods. Therefore, the stock is associated with every three words. So, the correct answer is stock.", "Reason-chain-wo-meta": "A pile stock is a pile of things for future use, a stock market is a place where you can sell and buy stocks, and a room is a good place for stock goods. So, the correct answer is stock."}
{"Item": "water / mine / shaker", "Answer": "salt", "Reason": "Saltwater describes salty bodies of water, a salt mine is a place where you can extract salt, and a saltshaker is a container for sprinkling salt. So, the correct answer is salt.", "Reason-reversed-meta": "The correct answer is salt. Because salt can be used to make compounds with every three words. Saltwater refers to salty bodies of water, a salt mine is a place where you can extract salt, and a saltshaker is a container for sprinkling salt.", "Reasons-reversed": "The correct answer is salt. Saltwater refers to salty bodies of water, a salt mine is a place where you can extract salt, and a saltshaker is a container for sprinkling salt.", "Reason-chain": "Saltwater refers to salty bodies of water, a salt mine is a place where you can extract salt, and a saltshaker is a container for sprinkling salt. Therefore, salt can be used to make compounds with every three words. So, the correct answer is salt.", "Reason-chain-wo-meta": "Saltwater refers to salty bodies of water, a salt mine is a place where you can extract salt, and a saltshaker is a container for sprinkling salt. So, the correct answer is salt."}
{"Item": "water / tobacco / stove", "Answer": "pipe", "Reason": "A pipe is used to smoke tobacco and stove, and to flow water. So, the correct answer is pipe.", "Reason-reversed-meta": "The correct answer is pipe. Because pipe can be used with every three words in the context of the tool. A water pipe is a pipe for conveying water, a pipe is used for smoking tobacco, and a stove pipe connects stoves to chimney inlets.", "Reasons-reversed": "The correct answer is pipe. A water pipe is a pipe for conveying water, a pipe is used for smoking tobacco, and a stove pipe connects stoves to chimney inlets.", "Reason-chain": "A water pipe is a pipe for conveying water, a pipe is used for smoking tobacco, and a stove pipe connects stoves to chimney inlets. Therefore, pipe can be used with every three words in the context of the tool. So, the correct answer is pipe.", "Reason-chain-wo-meta": "A water pipe is a pipe for conveying water, a pipe is used for smoking tobacco, and a stove pipe connects stoves to chimney inlets. So, the correct answer is pipe."}
